{
    "intents": [
        {
            "tag": "greeting",
            "patterns": [
                "Hi",
                "Hey",
                "How are you",
                "Is anyone there?",
                "Hello",
                "Good day"
            ],
            "responses": [
                "Hey there! Welcome to Dormitory Management Bot.",
                "Hello! How can I assist you today?",
                "Hi there! What can I do for you?",
                "Hi there! How can I help you with dormitory management?"
            ]
        },
        {
            "tag": "goodbye",
            "patterns": ["Bye", "See you later", "Goodbye"],
            "responses": [
                "Goodbye! If you have any more questions, feel free to ask.",
                "See you later! Have a great day.",
                "Bye! Don't hesitate to return if you need further assistance."
            ]
        },
        {
            "tag": "thanks",
            "patterns": [
                "Thanks",
                "Thank you",
                "That's helpful",
                "Thank's a lot!"
            ],
            "responses": ["You're welcome!", "Glad I could help!", "Anytime!"]
        },
        {
            "tag": "register",
            "patterns": [
                "How can I register for the dormitory?",
                "What is the registration process?",
                "I want to register for the dorm."
            ],
            "responses": [
                "To register for the dormitory, please visit our online portal and complete the registration form.",
                "You can register for the dormitory by filling out the registration form on our website.",
                "To initiate the registration process, visit our website and follow the provided instructions."
            ]
        },
        {
            "tag": "payment",
            "patterns": [
                "How can I pay for my dormitory fees?",
                "What payment methods are accepted for dorm payments?",
                "Tell me about dormitory payment options."
            ],
            "responses": [
                "We accept payments through credit cards and online banking for dormitory fees.",
                "You can pay your dormitory fees using credit cards, bank transfers, or other online payment methods.",
                "Dormitory fees can be paid using various methods, including credit cards and online transfers."
            ]
        },
        {
            "tag": "due_date",
            "patterns": [
                "When is the deadline for paying dormitory fees?",
                "Tell me about the due date for dormitory payments.",
                "When do I need to pay my dorm fees?"
            ],
            "responses": [
                "The deadline for paying dormitory fees is [due date]. Please ensure payment is made by then.",
                "Dormitory fees must be paid by [due date]. Late payments may incur additional charges.",
                "The due date for dormitory fee payments is [due date]. Please make sure to pay on time."
            ]
        },
        {
            "tag": "services",
            "patterns": [
                "What services are offered in the dormitory?",
                "Tell me about the amenities in the dorm.",
                "List dormitory services and facilities."
            ],
            "responses": [
                "Our dormitory offers a range of services, including laundry facilities, common rooms, and 24/7 security.",
                "Amenities in the dorm include Wi-Fi, study areas, and recreational spaces for students.",
                "Dormitory services include [list of services]. Feel free to ask if you need more details about any specific service."
            ]
        }
    ]
}
